Public Member Functions | Friends | List of all members
ACAPI::MEP::ElementUIManager Class Referencefinal
MEP Element Manager
The ElementUIManager contains UI-related services for an Element. More...
#include <MEPElementUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::ElementUIManager:
 Public Member Functions
Result< ElementDefault >  | CreateElementDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a ElementDefault from a toolUIData.
Result< void >  | ApplyElementDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const ElementDefault &elementDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< ElementUIManager >  | CreateElementUIManager ()
Creates a ElementUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The ElementUIManager contains UI-related services for an Element.
Since
Archicad 28
Member Function Documentation
◆ ApplyElementDefaultToToolUIData()
 Result< void > ACAPI::MEP::ElementUIManager::ApplyElementDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const ElementDefault & |  elementDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
elementDefault | The default to be set
Returns
Returns error if the ElementDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateElementDefaultFromToolUIData()
 Result< ElementDefault > ACAPI::MEP::ElementUIManager::CreateElementDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a ElementDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Element in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an ElementDefault, otherwise returns the ElementDefault created from it.
Friends And Related Symbol Documentation
◆ CreateElementUIManager
 Result< ElementUIManager > CreateElementUIManager  |  ( |   | )
friend
Creates a ElementUIManager.
Returns
If able, creates a new manager for Element, otherwise Error.